🚀&nbsp; env0 had composed a PR Plan for environment [Research Environments / github PR example-27993 ](https://app.env0.com/p/QDK4IMekJVUczZZsfzNsK/environments/f78fc414-330f-4f7e-bae8-28645caf6016):
```
Plan: 6 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.website_bucket will be created
+   resource "aws_s3_bucket" "website_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = "public-read"
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)

+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "env0_environment_id" = "f78fc414-330f-4f7e-bae8-28645caf6016"
+           "env0_project_id"     = "qdk4imekjvuczzzsfznsk"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       versioning {

+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_object.object will be created
+   resource "aws_s3_bucket_object" "object" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       content_type           = "text/html"
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "index.html"
+       server_side_encryption = (known after apply)
+       source                 = "../index.html"
+       storage_class          = (known after apply)
+       tags                   = {
+           "env0_environment_id" = "f78fc414-330f-4f7e-bae8-28645caf6016"
+           "env0_project_id"     = "qdk4imekjvuczzzsfznsk"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_bucket_policy.website_bucket_policy will be created
+   resource "aws_s3_bucket_policy" "website_bucket_policy" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # random_id.id3 will be created
+   resource "random_id" "id3" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 8
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_id.id4 will be created
+   resource "random_id" "id4" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 8
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_string.random will be created
+   resource "random_string" "random" {
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 16
+       min_numeric = 0

+       min_special = 0
+       min_upper   = 0
+       number      = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

  on env0.auto.tfvars.json line 1:
   1: {"region":"us-east-1"}

The root module does not declare a variable named "region". To use this value,
add a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```
</details>


```
Monthly cost change for ohad1282/desktop-tutorial/.tf-plan
Amount:  $0.00 ($0.00 → $0.00)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Project: ohad1282/desktop-tutorial/.tf-plan

+ aws_s3_bucket.website_bucket
  Monthly cost depends on usage

+     Standard
    
+         Storage
          Monthly cost depends on usage
            +$0.023 per GB
    
+         PUT, COPY, POST, LIST requests
          Monthly cost depends on usage
            +$0.005 per 1k requests
    
+         GET, SELECT, and all other requests
          Monthly cost depends on usage
            +$0.0004 per 1k requests
    
+         Select data scanned
          Monthly cost depends on usage
            +$0.002 per GB
    
+         Select data returned
          Monthly cost depends on usage
            +$0.0007 per GB

Monthly cost change for ohad1282/desktop-tutorial/.tf-plan
Amount:  $0.00 ($0.00 → $0.00)

──────────────────────────────────
Key: ~ changed, + added, - removed

3 cloud resources were detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file
∙ 2 were free, rerun with --show-skipped to see details
```
</details>


[Full PR Plan logs on env0](https://app.env0.com/p/QDK4IMekJVUczZZsfzNsK/environments/f78fc414-330f-4f7e-bae8-28645caf6016/deployments/f96f2fc7-1979-4fa1-8038-027e852cb23f)